## Plan Result (sbox-sandbox)




<pre><code>Plan: 78 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.saat-idam-internal.azurerm_private_dns_zone.zone[0]
  * module.saat-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-sbox-vnet&#34;]
  * module.saat-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-saat-idam-internal&#34;]
  * module.saat-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.saat-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.sandbox-idam-internal.azurerm_private_dns_zone.zone[0]
  * module.sandbox-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-sbox-vnet&#34;]
  * module.sandbox-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-sandbox-idam-internal&#34;]
  * module.sandbox-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.sandbox-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-sandbox-idam-internal&#34;]
  * module.sandbox-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.sandbox-internal.azurerm_private_dns_zone.zone[0]
  * module.sandbox-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-sbox-vnet&#34;]
  * module.sandbox-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-sandbox-internal&#34;]
  * module.sandbox-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.sandbox-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-sandbox-internal&#34;]
  * module.sandbox-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;alertmanager-00&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;alertmanager-01&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;alertmanager-mgmt-sbox&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;artifactory&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;backstage&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;cft-api-mgmt&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;cvp-recording&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;grafana&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;hmi-pact&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;hmi-wiremock&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;netbox&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;pact-broker&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;portal&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;prometheus-00&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;prometheus-01&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;prometheus-mgmt-sbox&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;sds-alertmanager-00&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;sds-alertmanager-00-ptl&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;sds-alertmanager-01&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;sds-api-mgmt&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;sds-grafana&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;sds-prometheus-00&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;sds-prometheus-00-ptl&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;sds-prometheus-01&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;tenable-sc&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;traefik-sds-00&#34;]
  * module.sandbox-platform.azurerm_private_dns_a_record.this[&#34;traefik-sds-01&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;bar&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;fees-register&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;hmi-apim&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;idam-api&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;idam-api-sprod&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;idam-web-admin&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;idam-web-admin-sprod&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;idam-web-public&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;idam-web-public-sprod&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;labs-louisehuyton-walkthrough&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;labs-zcwalkthrough-nodejs&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;moneyclaim&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;moneyclaim-legal&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;payment&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;plum&#34;]
  * module.sandbox-platform.azurerm_private_dns_cname_record.this[&#34;toffee&#34;]
  * module.sandbox-platform.azurerm_private_dns_zone.zone[0]
  * module.sandbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-sbox-vnet&#34;]
  * module.sandbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-sandbox-platform&#34;]
  * module.sandbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.sandbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-sandbox-platform&#34;]
  * module.sandbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;hmi-sharedinfra-vnet-sbox&#34;]
  * module.sandbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.sbox-platform.azurerm_private_dns_cname_record.this[&#34;vh-admin-web&#34;]
  * module.sbox-platform.azurerm_private_dns_cname_record.this[&#34;vh-service-web&#34;]
  * module.sbox-platform.azurerm_private_dns_cname_record.this[&#34;vh-test-web&#34;]
  * module.sbox-platform.azurerm_private_dns_cname_record.this[&#34;vh-video-web&#34;]
  * module.sbox-platform.azurerm_private_dns_zone.zone[0]
  * module.sbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-sbox-vnet&#34;]
  * module.sbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-sandbox-platform&#34;]
  * module.sbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.sbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-sandbox-platform&#34;]
  * module.sbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;hmi-sharedinfra-vnet-sbox&#34;]
  * module.sbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.saat-idam-internal.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "service.core-compute-idam-saat.internal"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.saat-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-sbox-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-sbox-vnet"
      + private_dns_zone_name = "service.core-compute-idam-saat.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/b3394340-6c9f-44ca-aa3e-9ff38bd1f9ac/resourceGroups/bastion-sbox-rg/providers/Microsoft.Network/virtualNetworks/bastion-sbox-vnet"
    }

  # module.saat-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-saat-idam-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-saat-idam-internal"
      + private_dns_zone_name = "service.core-compute-idam-saat.internal"
      + registration_enabled  = true
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-idam-saat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-saat"
    }

  # module.saat-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "service.core-compute-idam-saat.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.saat-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "service.core-compute-idam-saat.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.sandbox-idam-internal.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "service.core-compute-idam-sandbox.internal"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.sandbox-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-sbox-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-sbox-vnet"
      + private_dns_zone_name = "service.core-compute-idam-sandbox.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/b3394340-6c9f-44ca-aa3e-9ff38bd1f9ac/resourceGroups/bastion-sbox-rg/providers/Microsoft.Network/virtualNetworks/bastion-sbox-vnet"
    }

  # module.sandbox-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-sandbox-idam-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-sandbox-idam-internal"
      + private_dns_zone_name = "service.core-compute-idam-sandbox.internal"
      + registration_enabled  = true
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-idam-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-sandbox"
    }

  # module.sandbox-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "service.core-compute-idam-sandbox.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.sandbox-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-sandbox-idam-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-sandbox-idam-internal"
      + private_dns_zone_name = "service.core-compute-idam-sandbox.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-sandbox"
    }

  # module.sandbox-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "service.core-compute-idam-sandbox.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.sandbox-internal.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "service.core-compute-sandbox.internal"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.sandbox-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-sbox-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-sbox-vnet"
      + private_dns_zone_name = "service.core-compute-sandbox.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/b3394340-6c9f-44ca-aa3e-9ff38bd1f9ac/resourceGroups/bastion-sbox-rg/providers/Microsoft.Network/virtualNetworks/bastion-sbox-vnet"
    }

  # module.sandbox-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-sandbox-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-sandbox-internal"
      + private_dns_zone_name = "service.core-compute-sandbox.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-idam-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-sandbox"
    }

  # module.sandbox-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "service.core-compute-sandbox.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.sandbox-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-sandbox-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-sandbox-internal"
      + private_dns_zone_name = "service.core-compute-sandbox.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-sandbox"
    }

  # module.sandbox-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "service.core-compute-sandbox.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["alertmanager-00"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "alertmanager-00"
      + records             = [
          + "10.2.9.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["alertmanager-01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "alertmanager-01"
      + records             = [
          + "10.2.11.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["alertmanager-mgmt-sbox"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "alertmanager-mgmt-sbox"
      + records             = [
          + "10.70.25.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["artifactory"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "artifactory"
      + records             = [
          + "10.70.25.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["backstage"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "backstage"
      + records             = [
          + "10.70.25.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["cft-api-mgmt"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cft-api-mgmt"
      + records             = [
          + "10.2.14.5",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["cvp-recording"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cvp-recording"
      + records             = [
          + "10.50.11.10",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["grafana"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "grafana"
      + records             = [
          + "10.70.25.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["hmi-pact"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hmi-pact"
      + records             = [
          + "10.140.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["hmi-wiremock"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hmi-wiremock"
      + records             = [
          + "10.140.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["netbox"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "netbox"
      + records             = [
          + "10.147.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["pact-broker"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pact-broker"
      + records             = [
          + "10.70.25.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["portal"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "portal"
      + records             = [
          + "51.132.209.233",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["prometheus-00"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prometheus-00"
      + records             = [
          + "10.2.9.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["prometheus-01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prometheus-01"
      + records             = [
          + "10.2.11.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["prometheus-mgmt-sbox"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prometheus-mgmt-sbox"
      + records             = [
          + "10.70.25.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["sds-alertmanager-00"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-alertmanager-00"
      + records             = [
          + "10.140.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["sds-alertmanager-00-ptl"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-alertmanager-00-ptl"
      + records             = [
          + "10.147.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["sds-alertmanager-01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-alertmanager-01"
      + records             = [
          + "10.140.31.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["sds-api-mgmt"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-api-mgmt"
      + records             = [
          + "10.140.33.133",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["sds-grafana"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-grafana"
      + records             = [
          + "10.147.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["sds-prometheus-00"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-prometheus-00"
      + records             = [
          + "10.140.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["sds-prometheus-00-ptl"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-prometheus-00-ptl"
      + records             = [
          + "10.147.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["sds-prometheus-01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-prometheus-01"
      + records             = [
          + "10.140.31.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["tenable-sc"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "tenable-sc"
      + records             = [
          + "10.0.17.132",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["traefik-sds-00"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "traefik-sds-00"
      + records             = [
          + "10.140.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_a_record.this["traefik-sds-01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "traefik-sds-01"
      + records             = [
          + "10.140.31.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["bar"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bar"
      + record              = "sandbox-waf.sandbox.platform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["fees-register"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "fees-register"
      + record              = "sandbox-waf.sandbox.platform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["hmi-apim"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hmi-apim"
      + record              = "hmcts-sbox.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["idam-api"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-api"
      + record              = "idam-api-sbox.service.core-compute-sandbox.internal."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["idam-api-sprod"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-api-sprod"
      + record              = "idam-api-sprod-sbox.service.core-compute-sandbox.internal."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["idam-web-admin"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-admin"
      + record              = "hmcts-sbox.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["idam-web-admin-sprod"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-admin-sprod"
      + record              = "idam-api-sprod-sbox.service.core-compute-sandbox.internal."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["idam-web-public"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-public"
      + record              = "hmcts-sbox.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["idam-web-public-sprod"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-public-sprod"
      + record              = "hmcts-sbox.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["labs-louisehuyton-walkthrough"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "labs-louisehuyton-walkthrough"
      + record              = "hmcts-sbox.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["labs-zcwalkthrough-nodejs"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "labs-zcwalkthrough-nodejs"
      + record              = "hmcts-sbox.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["moneyclaim"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "moneyclaim"
      + record              = "sandbox-waf.sandbox.platform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["moneyclaim-legal"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "moneyclaim-legal"
      + record              = "sandbox-waf.sandbox.platform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["payment"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "payment"
      + record              = "sandbox-waf.sandbox.platform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["plum"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "plum"
      + record              = "hmcts-sbox.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_cname_record.this["toffee"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "toffee"
      + record              = "sdshmcts-sbox.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.sandbox-platform.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "sandbox.platform.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.sandbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-sbox-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-sbox-vnet"
      + private_dns_zone_name = "sandbox.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/b3394340-6c9f-44ca-aa3e-9ff38bd1f9ac/resourceGroups/bastion-sbox-rg/providers/Microsoft.Network/virtualNetworks/bastion-sbox-vnet"
    }

  # module.sandbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-sandbox-platform"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-sandbox-platform"
      + private_dns_zone_name = "sandbox.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-idam-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-sandbox"
    }

  # module.sandbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "sandbox.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.sandbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-sandbox-platform"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-sandbox-platform"
      + private_dns_zone_name = "sandbox.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-sandbox"
    }

  # module.sandbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["hmi-sharedinfra-vnet-sbox"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "hmi-sharedinfra-vnet-sbox"
      + private_dns_zone_name = "sandbox.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/hmi-sharedinfra-sbox-rg/providers/Microsoft.Network/virtualNetworks/hmi-sharedinfra-vnet-sbox"
    }

  # module.sandbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "sandbox.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.sbox-platform.azurerm_private_dns_cname_record.this["vh-admin-web"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-admin-web"
      + record              = "sdshmcts-sbox.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sbox.platform.hmcts.net"
    }

  # module.sbox-platform.azurerm_private_dns_cname_record.this["vh-service-web"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-service-web"
      + record              = "sdshmcts-sbox.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sbox.platform.hmcts.net"
    }

  # module.sbox-platform.azurerm_private_dns_cname_record.this["vh-test-web"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-test-web"
      + record              = "sdshmcts-sbox.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sbox.platform.hmcts.net"
    }

  # module.sbox-platform.azurerm_private_dns_cname_record.this["vh-video-web"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-video-web"
      + record              = "sdshmcts-sbox.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sbox.platform.hmcts.net"
    }

  # module.sbox-platform.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "sbox.platform.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.sbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-sbox-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-sbox-vnet"
      + private_dns_zone_name = "sbox.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/b3394340-6c9f-44ca-aa3e-9ff38bd1f9ac/resourceGroups/bastion-sbox-rg/providers/Microsoft.Network/virtualNetworks/bastion-sbox-vnet"
    }

  # module.sbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-sandbox-platform"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-sandbox-platform"
      + private_dns_zone_name = "sbox.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-idam-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-sandbox"
    }

  # module.sbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "sbox.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.sbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-sandbox-platform"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-sandbox-platform"
      + private_dns_zone_name = "sbox.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-sandbox"
    }

  # module.sbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["hmi-sharedinfra-vnet-sbox"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "hmi-sharedinfra-vnet-sbox"
      + private_dns_zone_name = "sbox.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/hmi-sharedinfra-sbox-rg/providers/Microsoft.Network/virtualNetworks/hmi-sharedinfra-vnet-sbox"
    }

  # module.sbox-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "sbox.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

Plan: 78 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":420,"Program":"tfcmt","SHA1":"","Target":"sbox-sandbox","Vars":{}} -->